"""
. Хэрэглэгчид ойлгомжтой терминал дээр ĸомандын мөрийн интерфэйс үүсгэх
. Дор хаяж гурван температурын хэмжүүр хооронд хөрвүүлэх боломжтой байх:
Цельс (°C)
Фаренгейт (°F)
Кельвин (K)
. Хэрэглэгчийн оролтыг хүлээн авах:
Эх температурын хэмжүүр
Зорилтот температурын хэмжүүр
Температурын утга
. Хөрвүүлсэн температурыг зохих форматтайгаар харуулах
. Буруу оролтуудыг тодорхой алдааны мессежтэйгээр зөв боловсруулах
. Программыг дахин эхлүүлэлгүйгээр олон удаагийн хөрвүүлэлт хийх боломжтой байх
. Программаас гарах сонголт оруулах
. Зөв баталгаажуулалт хийх (жишээ нь, Кельвин 0-ээс доош байж болохгүй)
"""

print("Python программчлын хэл дээр бичсэн температур хөрвүүлэгч программд тавтай морил!")
eh_temperature = input("""Эх тэмператураа оруулна уу
Кельвин бол: K
Фаренгейт бол: F
Цельси бол: C
Бичнэ үү""")
zoriltot_temperature = input(""" Зорилтот тэмператураа оруулна уу
Кельвин бол: K
Фаренгейт бол: F
Цельси бол: C
Бичнэ үү""")

if eh_temperature == "K":
    eh_temperature = float(input("Хэдэн  "))